{"data":{"site":{"siteMetadata":{"author":{"name":"Andre Pena","contacts":{"twitter":"andrerpena"}},"disqusShortname":"","subtitle":"Software engineer","title":"Blog by Andre Pena","url":"https://lumen.netlify.com"}},"markdownRemark":{"id":"eb429d64-35c9-5487-b69d-2c23e33e1049","html":"<blockquote>\n<p>Success is no accident. It is hard work, perseverance, learning, studying, sacrifice and most of all, love of what you are doing or learning to do. - 🇧🇷 Pele</p>\n</blockquote>\n<p>🎉 <a href=\"https://remoted.io\">https://remoted.io</a> is live. I first wrote the first lines of code during the Christmas of 2018, while visiting friends in the UK. Now, exactly 4 months later, it is live, and I did everything by myself 😌.</p>\n<p>Remoted is a <strong>remote job aggregator for developers and IT professionals</strong>. I basically built a crawling engine on top of Puppeteer and wrote 3 crawlers, for starters: StackOverflow, WeWorkRemotely and AuthenticJobs. I plan to have more sources and expand the jobs to also include Design, Marketing, Product and Project Management, but I needed to release an MVP ASAP. Remoted is cool because it has better 🕵️‍♂️search options than the competition.</p>\n<p><strong>On this post, I will explain my motivation and the reasoning behind my choices on the technology stack</strong>.</p>\n<h2 id=\"motivation\"><a href=\"#motivation\" aria-label=\"motivation permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Motivation</h2>\n<p>Let’s start with the motivation. Why did I do it? The simplest answer: <strong>To satisfy my creativity</strong>, since I naturally feel like creating stuff is the best use of my time, and, at the same time, <strong>to buy a lottery ticket</strong> by building something that that has at least a tiny chance of ever generating passive income. I say lottery ticket because I’ve read <a href=\"https://indiehackers.com\">https://indiehackers.com</a> enough to know how hard it is for people to make money from side projects. But I think it’s worth a try.</p>\n<p>How do you decide what to create? You need to find a product in the intersection of…</p>\n<ol>\n<li>Something you can complete alone, or with the resources you have, and release an MVP in 6 months.</li>\n<li>Something that you see yourself doing after 5 to 10 years.</li>\n<li>Something that has a proven, existing market, but you know you can make it a bit better than the competition.</li>\n<li>Something with a low risk of having a big company crushing you before you get traction.</li>\n</ol>\n<p>Most of these ideas are not mine, though. <a href=\"https://levels.io/\">Peter Levels</a> talks in details about these topics in his <a href=\"https://makebook.io/\">awesome book MAKE</a>.</p>\n<h3 id=\"♂️-build-something-you-can-complete-alone-or-with-the-resources-you-have-and-release-an-mvp-in-6-months\"><a href=\"#%E2%99%82%EF%B8%8F-build-something-you-can-complete-alone-or-with-the-resources-you-have-and-release-an-mvp-in-6-months\" aria-label=\"♂️ build something you can complete alone or with the resources you have and release an mvp in 6 months permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>🏃🏻‍♂️ Build something you can complete alone, or with the resources you have, and release an MVP in 6 months.</h3>\n<p>It is super easy to overestimate your own capacity to deliver, because you cannot anticipate all the tiny things you’ll have to deliver. For example, on Remoted, I was completely unaware <a href=\"http://ogp.me/\">Open Graph</a> meta tags, and I completely forgot to set up the newsletter to capture the first wave of visitors from the original campaign. There were a lot of other small stuff I had to refactor based on feedback.</p>\n<p>You want to select something that you would think ”😃 Pff, this will be pretty quick” to end up with a ”😅 Ok, that was hard but it’s done”.</p>\n<p>On the flip side, sole developers don’t need approval or alignment meetings.</p>\n<h3 id=\"-build-something-you-see-yourself-doing-in-5-to-10-years\"><a href=\"#-build-something-you-see-yourself-doing-in-5-to-10-years\" aria-label=\" build something you see yourself doing in 5 to 10 years permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>👴🏻 Build something you see yourself doing in 5 to 10 years.</h3>\n<p>This one is special for me because I am a bit traumatized by the fact that, even though I have a very creative mindset and inspite the fact I have created multiple projects throughout my life, the only ones I have to show Remoted, which I just released, and <a href=\"https://github.com/andrerpena/react-mde\">React-Mde, my React Markdown Editor</a>, which is now top <a href=\"https://www.google.com/search?q=react+markdown+editor&#x26;oq=react+markdown+editor&#x26;aqs=chrome..69i57j69i60j69i61.4508j0j1&#x26;sourceid=chrome&#x26;ie=UTF-8\">Google result for React Markdown Editor</a>. This may look like something but it is very little considering the fact the I’m 34 years old now and I’ve been creating stuff since I was 22. Where are these 12 years of projects? All dead/abandoned. I don’t want to repeat that. I want to create something that will grow over time and become my legacy. Success take a lot of time and it also took a long time for me to realize that.</p>\n<p><a href=\"https://twitter.com/bendhalpern?lang=en\">Ben Halpern</a> once said, <a href=\"https://dev.to/ben/comment/oan\">referring to the creation of dev.to</a>:</p>\n<blockquote>\n<p>My main key was to allow the project to take forever to grow. I said I’d be okay if it took 10 years and worked on it very gradually. I observed what worked and what did not and put myself into it. - Ben Halpern[]</p>\n</blockquote>\n<p>In my case, it also helped to understand exactly motivation fo starting and stopping projects.</p>\n<h4 id=\"-why-did-i-start-projects\"><a href=\"#-why-did-i-start-projects\" aria-label=\" why did i start projects permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>💡 Why did I start projects?</h4>\n<p>As I mentioned, buying a lottery ticket, that is, having that slight change of success is a big motivator, but this is not all. Honestly, at least for me, money is not the bigger motivator. I really like learning new technologies. The best way to learn is by doing, and side projects are a very good fit for it. While picking a stack, I try to combine <strong>things that I know already</strong>, that gives me a sense of speed since I know what I’m doing, with <strong>things that I want to learn</strong>, which gives me a sense of personal development and improvement. Even if the project fails, all the experience I gained throughout the process ended up making me a better professional.</p>\n<h4 id=\"-why-did-i-stop-maintaining-projects\"><a href=\"#-why-did-i-stop-maintaining-projects\" aria-label=\" why did i stop maintaining projects permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>😵 Why did I stop maintaining projects?</h4>\n<p>One reason is very personal and it took me a lot of self-knowledge to get to this conclusion: I found I don’t enjoy having co-founders because I already have to report what/why I’m doing stuff on my fulltime job. I don’t want this commitment on my free time. I want to be creative, even if that means I will be wrong from time to time. I can fix stuff afterwards.</p>\n<p>The second reason was, I have to admit, that I’m amazingly bad identifying market opportunities. <strong>I bet I wouldn’t beat random</strong>. Which takes us to:</p>\n<h3 id=\"-build-something-that-has-a-proven-existing-market-but-you-know-you-can-make-it-a-bit-better-than-the-competition\"><a href=\"#-build-something-that-has-a-proven-existing-market-but-you-know-you-can-make-it-a-bit-better-than-the-competition\" aria-label=\" build something that has a proven existing market but you know you can make it a bit better than the competition permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>💰 Build something that has a proven, existing market, but you know you can make it a bit better than the competition.</h3>\n<p>Based on my own experience and abilities, I decided that <strong>I will no longer try to be innovative on the\nstuff I build on my spare time</strong>, for a single reason: Innovation means a lot of risk and\nI’m no longer going to risk my precious limited time. Don’t get me wrong, I’m all for innovation, the problem is that, in order to successfully innovate, you need a lot of market knowledge, research and room for failure. Stablished companies can and should risk part of their income in R&#x26;D for this is what keeps them ahead of the competition. For solo makers, however, the safest strategy is to stick to markets that are proven to be profitable and invest on improvements and refining of existing ideas. </p>\n<p>For Remoted, for example, I’m trying to explore what has been proven profitable already by other aggregators, especially <a href=\"https://remoteok.io\">https://remoteok.io</a>. The current version of Remoted is <strong>heavily</strong> inspired by RemoteOK, to be honest. The distinguishing feature of Remoted now is better filters and, IMHO, better information being shown right away (like salary). My plan now is to make the filters even better. As a risk mitigation strategy, I’m building Remoted as a platform to make it easier to release other job boards in case this one fails.</p>\n<p>If you need inspiration to identify markets that are known to be profitable, you can check the <a href=\"https://www.indiehackers.com/products?sorting=highest-revenue\">list of products on IndieHackers, sorted by revenue</a>.</p>\n<p>It is also important to have an idea of how to make stuff a bit better, and for this, being your own customer helps a lot. In this case, you would have already an idea of how existing solutions did not meet a particular need that you, personally, already had.</p>\n<h3 id=\"-build-something-that-has-low-risk-of-having-a-big-company-crushing-you-before-you-get-traction\"><a href=\"#-build-something-that-has-low-risk-of-having-a-big-company-crushing-you-before-you-get-traction\" aria-label=\" build something that has low risk of having a big company crushing you before you get traction permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>🤑 Build something that has low risk of having a big company crushing you before you get traction.</h3>\n<p>This is no news, but the best piece of advice I can give on this topic is: Go really, really niche. The more specific your product is, the least it makes sense for a big company to decide to target your market. Big companies tend to be broad because there is where the big money is. While working on your own side projects, focus on exploring the big tail of the market.</p>\n<h2 id=\"-technical-stack-and-implementation-details\"><a href=\"#-technical-stack-and-implementation-details\" aria-label=\" technical stack and implementation details permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>🤖 Technical stack and implementation details</h2>\n<p>They say that, for the MVP, it doesn’t really matter what technology you use, just use whatever you are familiar with and adapt after your product gains traction.</p>\n<p>In my opinion, yes, this is a sound advice, but technology stacks are not equally productive. I don’t have data to support that, but I believe that one of the reasons small startups sometimes are able to outperform giant market leaders is because they use modern technologies, which, besides the benefit of productivity, makes some developers more prone to invest their time and energy to make a great project. If technologies were equally productive, I don’t think there would be a lot of incentive for these new technologies to be created, in the first place.</p>\n<p>One example of technology that makes me super-productive is <a href=\"https://www.typescriptlang.org/\">TypeScript</a>. Not everybody will agree, specially because there is, indeed, a productivity penalty for adding types to stuff and I agree. But it also helps you to catch bugs before running the code, and refactoring your code is <em>times</em> faster and more reliable using TypeScript. I would recommend TypeScript for absolutelly any size of project. Remoted is relatively small and still, I’ve made around 3 to 4 major refactoring throughout the development and it would have been much more painful with TypeScript. </p>\n<p>Another example is Next.js. It’s amazing. It has:</p>\n<ul>\n<li>Out of the box Webpack setup. One of the push-backs for React adoption is how complicated it is to even get started. Next.js and Create-react-app solve this problem magnificently.</li>\n<li>Out of the box Hot Module Replacement. You see the result of your work without having to refresh the page.</li>\n<li>Out of the box Server Side Rendering. This is a huge plus for SEO. If you don’t need this, consider using Create-react-app.</li>\n<li>Nice way to handle server specific tags, like <em>meta</em> tags and <em>title</em>.</li>\n<li>Easy to support PWA and AMP. PWA is great for user retention and AMP helps a lot with SEO.</li>\n<li>A great community and ecosystem. For example, I problem I did not anticipate was the need for specific meta tags for handling text and images for different social media like Twitter and Facebook. Fortunately, there’s <a href=\"https://github.com/garmeeh/next-seo\">Next-seo</a> that helps a lot.</li>\n<li>Support for basically any React State library you can imagine. <a href=\"https://github.com/zeit/next.js/tree/master/examples\">Check out their examples</a>.</li>\n</ul>\n<h3 id=\"-here-is-the-complete-remoted-tech-stack\"><a href=\"#-here-is-the-complete-remoted-tech-stack\" aria-label=\" here is the complete remoted tech stack permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>💻 Here is the complete Remoted tech stack:</h3>\n<p>I have to admit this stack is much more complex than it would be usually necessary, but please, take two things in to account: 1) I said that, for me, personally, learning new technologies is part of what motivates me work. For you, it might not be the case. 2) These technologies made me productive and it has been a pleasure to work with them all. Yes, it took me a while to learn them, but the effort paid off, both in terms of personal development, and in terms of productivity.</p>\n<ul>\n<li>Hosting: <a href=\"https://www.digitalocean.com/\">DigitalOcean</a>. This one was hard, because I had zero previous experience with VPS management. I thought about releasing with <a href=\"https://www.heroku.com/\">Heroku</a>, but because I plan to release multiple projects, it would be too expensive to go that way. It took me around 15 hours to learn and to to set up DigitalOcean, including Nginx and TLS. Now, to deploy a new website, it will be super easy.</li>\n<li>Database: <a href=\"https://www.postgresql.org/\">Postgres</a>. This one was also not obvious. For the majority of MVP projects, all you need is <a href=\"https://www.sqlite.org/index.html\">SqLite</a>. A good reason to go Postgres is when you anticipate the need for full-text or spacial/geolocation search. Also, another question was whether to go managed or unmanaged. Again, because I needed to be able to deploy multiple projects, going managed would be too expensive. The feedback I received from a lot of indie hackers is that managing Postgres yourself is not as hard as it sounds. I’m having a good experience so far. </li>\n<li>App server: <a href=\"https://nodejs.org/en/\">Node.js</a> with <a href=\"https://www.typescriptlang.org/\">TypeScript</a>. Node is amazing for the ecosystem alone. You can basically find anything you need on NPM. For example: <a href=\"https://github.com/ekalinin/sitemap.js\">Sitemap</a> and <a href=\"https://github.com/jpmonette/feed\">RSS feeds</a>.</li>\n<li>Process management: <a href=\"http://pm2.keymetrics.io/\">PM2</a>. This is only relevant for Node. Node runs only 1 thread per process. This causes the problem that you need a mini-load-balancer if you’re using multiple processes. PM2 does that, PM2 also does a very good job organizing your logs/errors.</li>\n<li>Web server: <a href=\"https://www.nginx.com/\">Nginx</a>. Node developers often don’t understand why you would Need Nginx if you can use <a href=\"https://expressjs.com/\">Express</a> for everything. Three reasons I use it for: 1) TLS/SSL certificates from LetsEncrypt, including auto-renewing, was a breeze due awesome <a href=\"https://certbot.eff.org/\">Certbot</a> integration. 2) Node output cache and static resources cache is much better than anything you can do with Express. 3) Rate limit.</li>\n<li>Crawlers: <a href=\"https://github.com/GoogleChrome/puppeteer\">Puppeteer</a>: I believe no language can beat JavaScript/TypeScript for making bots, for the sole reason that you can execute your code <em>inside the context of the browser</em>. What I mean by that is: I can pass a function to Puppeteer, that I expect will run inside the page that I’m crawling. this is super useful for collecting information. If you make a crawler in Python, for example, even with Chromium is being used under the hoods, you would have to switch to JavaScript to control the browser, internally. With JavaScript/TypeScript, it’s the same language, the code is more straight-forward.</li>\n<li>UI: <a href=\"https://reactjs.org/\">React</a> with <a href=\"https://github.com/zeit/next.js/\">Next.js</a> + <a href=\"https://www.apollographql.com/docs/react/\">Apollo</a>. Next.js is basically a runtime that allows you to use React with SSR out of the box. It’s fantastic. Apollo made it super easy to set up my API.</li>\n<li>API: <a href=\"https://graphql.org/learn/\">GraphQL</a>. Not trying to predict anything, but there is a chance GraphQL will become the de facto standard for REST APIs because it is statically typed, self-documented and it enforces consistency.</li>\n<li>CI/CD: <a href=\"https://codeship.com/\">Codeship</a>. One question I had in mind when I chose to run a VPS with DigitalOcean is how would I manage CI/CD, that comes out of the box with Heroku. The answer was Codeship. Basically, they will test your code and, if the code passes, they will deploy. They support deploying to all major cloud providers, but for a VPS, you just upload an SSH certificate and let them connect to your VPS, after a push and successful tests, and <em>git pull</em>.</li>\n<li>DNS and CDN: <a href=\"https://www.cloudflare.com/\">Cloudflare</a>. Everybody uses Cloudflare. Most common use cases, not in a particular order: 1) Redirect <em>www</em> to <em>non-wwww</em>, 2) Basic DDoS protection. 3) Caching 4) TLS. Specifically for Remoted, I have the CloudFlare issued TLS certificate between the edge and my VPS, and a LetsEncrypt TLS on the </li>\n</ul>\n<h2 id=\"conclusion\"><a href=\"#conclusion\" aria-label=\"conclusion permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h2>\n<p>It’s been 4 months of a lot of learnings and I’m feeling happy and accomplished for being able to deliver Remoted. One of the things that make me feel good about myself is my ability to stick to the plan and to actually deliver everything I said I would. I’m happy that, this time, it was the case.</p>","fields":{"slug":"/posts/i-just-released-remoted-io/","tagSlugs":["/tag/remoted/","/tag/remote-work/","/tag/web-development/"]},"frontmatter":{"date":"2019-04-24T14:43:32.169Z","description":"Releasing an Indie Hacker product - My personal journey through making Remoted.io","tags":["Remoted","Remote work","Web Development"],"title":"Releasing an Indie Hacker product - My personal journey through making Remoted.io"}}},"pageContext":{"slug":"/posts/i-just-released-remoted-io/"}}